//
//  ModelData.swift
//  LettersGame_iOS
//
//  Created by Volodymyr Yehorov on 10.12.2023.
//

//import Foundation

//@Observable
struct ModelData {

    let letters_orange: [String] = ["А", "В", "Е", "І", "Л", "Н", "О", "П", "С"]
    let words_orange: [String] = ["Поні", "Алое", "Лев", "Ліс", "Сіно", "Оса", "Слон", "Сова"]

    let letters_green: [String] = ["А", "В", "Д", "Е", "Є", "И", "І", "К", "Л", "М", "Н", "О", "П", "Т", "Ш", "Ь", "Ю", "Я"]
    let words_green: [String] = ["Поні", "Алое", "Лев", "Єнот", "Індик", "Конвалія", "Пітон", "Миша", "Півень", "Тюлень", "Пелікан"]

    let letters_blue: [String] = ["А", "Б", "В", "Е", "Є", "З", "Й", "К", "Л", "М", "Н", "О", "С", "У", "Х", "Ц", "Ь", "Я"]
    let words_blue: [String] = ["Буйвол", "Алое", "Лев", "Заєць", "Козел", "Оса", "Слон", "Сова", "Сойка", "Хомʼяк", "Ему"]

    let letters_purple: [String] = ["А", "Б", "Г", "Ґ", "Д", "Е", "И", "Ї", "Ф", "Ж", "З", "К", "П", "Р", "У", "Ч", "Щ", "Ь"]
    let words_purple: [String] = ["Курча", "Грак", "Гриф", "Їжак", "Жираф", "Зебра", "Ґедзь", "Гепард", "Чиж", "Карп", "Щука"]
}
